# coding=gbk
import pymysql
import pandas
db = pymysql.connect(host='localhost', user='root', password='zxc123456', port=3306,db='taobao',charset='utf8')
cursor = db.cursor()
sql = 'INSERT INTO taooo(ALI_ID,省份,城市,行政区,标的物类型,标的物名称,拍卖次数,竞价周期,延时周期,保证金,优先购买权人,变卖预缴款,变卖价,变卖周期,监督单位,成交时间,交易类型,报名人数,出价次数,是否限购,抵押物名称,评估价格,信用,当前价格,延时次数,处置单位,结束时间,成交价格,初始价格,itemURL,经度,纬度,市场价格,加价幅度,sellOff,起拍价格,开始时间,支持贷款,围观人数,交易状态,采集时间) values(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)'
cursor.execute(sql, (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41))
db.commit()
# db.close()

# {"ALI_ID":a1,"省份":'广东',"城市":"深圳","行政区":"罗湖","标的物类型":"住宅用房","标的物名称":a2,"拍卖次数":a3,"竞价周期":a4,"延时周期":a5,"保证金":a6,"优先购买权人":a7,
#                     "变卖预缴款":"","变卖价":"","变卖周期":'',"监督单位":'',"成交时间":a10,"交易类型":"拍卖","报名人数":a11,
#                     '出价次数':a12,'是否限购':a13,'抵押物名称':a2,"评估价格":a14,"信用":a15,'当前价格':a16,'延时次数':a17,'处置单位':a18,'结束时间':a19,"成交价格":a20,"初始价格":a21,'itemURL':a22,'经度':a23,
#                     "纬度":a24,"市场价格":a25,"加价幅度":a26,"sellOff":a27,"起拍价格":a28,"开始时间":a29,"支持贷款":a30,
#                     "围观人数":a31,"交易状态":a32,"采集时间":time.strftime("%Y-%m-%d %H:%M:%S", time.localtime())
#                     }
